// 1. Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// let nameJS = prompt("Яка офіційна назва JavaScript?");

// if (nameJS === "ECMAScript") {
//     alert("Вірно!");
// } else {
//     alert("Не знаєте? ECMAScript!");
// }
// console.log(nameJS);

// 2.  Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль  усіх парних чисел від min до max
// const max = 50;
// const min = 23;

// for (let index = max; index >= min; index--) {

//     if (index % 2 === 0) {

//         console.log(index)
//     }
// }

// 3.  Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

// let login = prompt("Ведіть логін");

// if (login === "Адмін") {
//   let message = prompt("Ведіть пароль");

//   console.log(message);

//   if (message) {
//     if (message === "Я головний") {
//       console.log("Здрастуйте!");
//     } else {
//       console.log("Невірний пароль!");
//     }
//   } else {
//     console.log("Скасовано");
//   }
// } else {
//   console.log("Я вас не знаю");
// }

// 4. При завантаженні сторінки користувачеві пропонується
// В prompt ввести число. Введення додається до значення
// Змінної total.
// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt.
// // Після того, як користувач припинив введення натиснувши накнопку Cancel,
//  показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число, а не довільний набір символів не потрібно.

// let enterNumber = prompt("Введіть число")
// let total = 0
// let check = false
// do {
//     if (enterNumber) {
//         total = total + Number(enterNumber)
//         enterNumber = prompt("Введіть число")
//         check = true
//     }
//     else {
//         alert(`Загальна сума введених чисел дорівнює ${total}`)
//         check = false
//     }
// } 
// while (check)