// 1. Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// let nameJS = prompt("Яка офіційна назва JavaScript?");

// if (nameJS === "ECMAScript") {
//     alert("Вірно!");
// } else {
//     alert("Не знаєте? ECMAScript!");
// }
// console.log(nameJS);

// 2.  Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль  усіх парних чисел від min до max
// const max = 50;
// const min = 23;

// for (let index = max; index >= min; index--) {

//     if (index % 2 === 0) {

//         console.log(index)
//     }
// }

// 3.  Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

// let login = prompt("Ведіть логін");

// if (login === "Адмін") {
//   let message = prompt("Ведіть пароль");

//   console.log(message);

//   if (message) {
//     if (message === "Я головний") {
//       console.log("Здрастуйте!");
//     } else {
//       console.log("Невірний пароль!");
//     }
//   } else {
//     console.log("Скасовано");
//   }
// } else {
//   console.log("Я вас не знаю");
// }

// 4. При завантаженні сторінки користувачеві пропонується
// В prompt ввести число. Введення додається до значення
// Змінної total.
// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt.
// // Після того, як користувач припинив введення натиснувши накнопку Cancel,
//  показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число, а не довільний набір символів не потрібно.

// let enterNumber = prompt("Введіть число")
// let total = 0
// let check = false
// do {
//     if (enterNumber) {
//         total = total + Number(enterNumber)
//         enterNumber = prompt("Введіть число")
//         check = true
//     }
//     else {
//         alert(`Загальна сума введених чисел дорівнює ${total}`)
//         check = false
//     }
// }
// while (check)

// У змінній min лежить число від 0 до 59.
//  Визначте, в яку чверть години потрапляє це число(у першу, другу, третю чи четверту).

// let min = prompt("введіть число")
// if (min <= 15) {
//     console.log("1-ша чверть")
// } else if (min > 15 && min < 30) {
//     console.log("2-га чверть")
// } else if (min >= 30 && min < 45) {
//     console.log("3-тя чверть")
// } else if (min >= 45 && min <= 59) {
//    console.log("4-тa чверть")
// } else {
//     console.log("введіть число не більше 59")
// }

// Дано рядок, що складається із символів, наприклад, 'abcde'.
//  Перевірте, що першим символом цього рядка є буква 'a'.
//  Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// let line = "abcde"
// if (line[0] === "a") {
//     console.log('так')
// } else {
//     console.log('ні')
// }

// Напишіть через свіч пошуку автора мови програмування
//  пишемо назву мови у шаблонному рядку отримує відповідь мова та автор
//  PHP Расмус Лердорф
//  C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
//  Swift Кріс Латтнер
//  JS Брендан Ейх
//  Java Джеймс Гослінг
//  Python Гвідо ван Россум

// let ask = prompt("введіть мову програмування")
// switch (ask) {
//     case "PHP":
//         console.log(`мова ${ask} автор - Расмус Лердорф`)
//         break;
    
//     case "C#":
//         console.log(`мова ${ask} автори - група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота`)
//         break
    
//      case "Swift":
//         console.log(`мова ${ask} автор - Кріс Латтнер`)
//         break
    
//     default:
//         console.log("не знаю такої мови")
// }

// НАПИШІТЬ ПРОГРАМУ, ЯКА БУДЕ ЗАПИТУВАТИ У КОРИСТУВАЧА ПЕРІОД ПІДПИСКИ НА СЕРВІС
// ТА ПОКАЗУВАТИМЕ ЦІНУ ПІДПИСКИ(ВИКОРИСТАЙ IF..ELSE, ТА ПЕРЕПИШИ НА SWITCH)
// ЯКЩО ДЕНЬ - ціна 1.99
// ЯУЩО НЕДІЛЯ - ціна 5.99
// ЯКЩО МІСЯЦЬ - ціна 10.99
// ЯКЩО РІК - ціна 100.99

// let period = prompt("введіть період підписки").toUpperCase()

// if (period === "ДЕНЬ") {
//     alert("ціна 1.99")
// } else if (period === "ТИЖДЕНЬ") {
//     alert("ціна 5.99")
// } else if (period === "МІСЯЦЬ") {
//     alert("ціна 10.99")
// } else if (period === "РІК") {
//     alert("ціна 100.99")
// } else {
//     alert("такий період підписки відсутній")
// }

// switch (period) {
//     case "ДЕНЬ":
//         alert("ціна 1.99")
//         break;
    
//      case "ТИЖДЕНЬ":
//         alert("ціна 5.99")
//         break;
    
//      case "МІСЯЦЬ":
//         alert("ціна 10.99")
//         break;
    
//      case "РІК":
//         alert("ціна 100.99")
//         break;

//     default:
//         alert("такий період підписки відсутній")
// }

// Запитати у користувача ім’я, пошту,
//     телефон, та показати у консолі
// "користувач __ використовує  __ пошту __ телефон"

// let fullName = prompt("введіть ім'я");
// let mail = prompt("введіть пошту");
// let phone = prompt("введіть номер телефону");
// alert(`користувач ${fullName} використовує  ${mail} пошту  ${phone} телефон`)

// Порахуйте суму товарів у корзині, потрібно ввести
// ціну 3 - х товарів і порахувати їх суму.

// let firstItem = prompt("введіть ціну першого товару");
// let secondItem = prompt("введіть ціну другого товару");
// let thirdItem = prompt("введіть ціну третього товару");
// alert(Number(firstItem) + Number(secondItem) + Number(thirdItem))

// Напишить програму, яка буде визначати довжину імені,
//     якщо ім’я більше 7 символів, консоль повідомлення "Wow, you  have a REALLY long name!", якщо меньше 7
// "Your name isn't very long"

// let surname = prompt("Введіть ім'я")
// if (surname.length > 7) {
//     alert("Wow, you  have a REALLY long name!");
// } else {
//     alert("Your name isn't very long")
// }

